src/cf/InformationRegisters/ПравилаУчетаВидовЭДДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПравилаУчетаВидовЭДДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Папка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПапкиВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Принимать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТребуетсяИзвещениеОПолучении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТребуетсяОтветнаяПодпись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонСодержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УдалитьВидЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьТипЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыПроизвольныхДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПравилаУчетаВидовЭДДО/Forms/НастройкаСозданияВнутреннихДокументов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьВопросыДеятельности = ПолучитьФункциональнуюОпцию("ИспользоватьВопросыДеятельности");
	ИспользоватьГрифыДоступа = ПолучитьФункциональнуюОпцию("ИспользоватьГрифыДоступа");
	
	ПараметрыДляИнициализации = ПараметрыИнициализацииФормы();
	ЗаполнитьЗначенияСвойств(ПараметрыДляИнициализации, Параметры);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыДляИнициализации);
	
	ОбязательноеУказаниеОтветственного =
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДокумента, "ОбязательноеУказаниеОтветственного");
	
	НастроитьЭлементыПоШаблону();
	
	Если МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		УстановитьВидимостьДоступностьПоПереходуНаНовуюВерсию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьПодсказкиЭлементовПоШаблону();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если НеобходимоЗадатьВопросОСохранении() Тогда
		ПоказатьВопросОСохраненииНастроек();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НеобходимоЗадатьВопросОНекорректныхНастройках() Тогда
		ПоказатьВопросОСохраненииНекорректныхНастроек();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонДокументаПриИзменении(Элемент)
	
	НастроитьЭлементыПоШаблону();
	НастроитьПодсказкиЭлементовПоШаблону();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПапкаПриИзменении(Элемент)
	
	НастроитьПодсказкиЭлементовПоШаблону();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрифДоступаПриИзменении(Элемент)
	
	НастроитьПодсказкиЭлементовПоШаблону();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросДеятельностиПриИзменении(Элемент)
	
	НастроитьПодсказкиЭлементовПоШаблону();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	НастроитьПодсказкиЭлементовПоШаблону();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонНаименованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МаксимальнаяДлинаСтроки",   500);
	ПараметрыФормы.Вставить("РазрешенПереносСтрок",      Ложь);
	ПараметрыФормы.Вставить("ШаблонСтроки",              ШаблонНаименования);
	ПараметрыФормы.Вставить("НаименованиеПоля",          НСтр("ru = 'Наименование документа'"));
	ПараметрыФормы.Вставить("ИмяМакетаДереваПараметров", "ДеревоПараметровСозданияДокумента");
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗавершениеРедактированияНаименования", ЭтотОбъект);
	
	ОткрытьФорму(
		"РегистрСведений.ПравилаУчетаВидовЭДДО.Форма.ФормаШаблонаСтроковыхПолей",
		ПараметрыФормы,
		ЭтотОбъект, , , ,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонСодержанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МаксимальнаяДлинаСтроки",   0);
	ПараметрыФормы.Вставить("РазрешенПереносСтрок",      Истина);
	ПараметрыФормы.Вставить("ШаблонСтроки",              ШаблонСодержания);
	ПараметрыФормы.Вставить("НаименованиеПоля",          НСтр("ru = 'Содержание документа'"));
	ПараметрыФормы.Вставить("ИмяМакетаДереваПараметров", "ДеревоПараметровСозданияДокумента");
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗавершениеРедактированияСодержания", ЭтотОбъект);
	
	ОткрытьФорму(
		"РегистрСведений.ПравилаУчетаВидовЭДДО.Форма.ФормаШаблонаСтроковыхПолей",
		ПараметрыФормы,
		ЭтотОбъект, , , ,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ШаблонНаименованияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонСодержанияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	ЗакрытьФормуССохранениемДанных = Истина;
	НеПоказыватьВопросОСохраненииПриЗакрытии = Истина;
	ВыполнитьЗакрытиеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	
	ЗакрытьФормуССохранениемДанных = Ложь;
	НеПоказыватьВопросОСохраненииПриЗакрытии = Истина;
	ВыполнитьЗакрытиеФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыИнициализацииФормы()
	
	ПараметрыИнициализации = Новый Структура;
	ПараметрыИнициализации.Вставить("ВидДокумента");
	ПараметрыИнициализации.Вставить("ВидДокументаЭДО");
	ПараметрыИнициализации.Вставить("ВопросДеятельности");
	ПараметрыИнициализации.Вставить("Ответственный");
	ПараметрыИнициализации.Вставить("Папка");
	ПараметрыИнициализации.Вставить("ГрифДоступа");
	ПараметрыИнициализации.Вставить("Шаблон");
	ПараметрыИнициализации.Вставить("ШаблонНаименования");
	ПараметрыИнициализации.Вставить("ШаблонСодержания");
	
	Возврат ПараметрыИнициализации;
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыПоШаблону()
	
	СтруктураПредставлений = Новый Структура;
	СтруктураПредставлений.Вставить("Папка");
	СтруктураПредставлений.Вставить("ВопросДеятельности");
	СтруктураПредставлений.Вставить("Ответственный");
	СтруктураПредставлений.Вставить("ГрифДоступа");
	
	ПапкаШаблона = Неопределено;
	ВопросДеятельностиШаблона = Неопределено;
	ОтветственныйШаблона = Неопределено;
	
	Если ЗначениеЗаполнено(Шаблон) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
				"ВЫБРАТЬ
				|	ПРЕДСТАВЛЕНИЕ(Шаблоны.Папка) КАК ПапкаПредставление,
				|	Шаблоны.Папка КАК Папка,
				|	ПРЕДСТАВЛЕНИЕ(Шаблоны.ВопросДеятельности) КАК ВопросДеятельностиПредставление,
				|	Шаблоны.ВопросДеятельности КАК ВопросДеятельности,
				|	ПРЕДСТАВЛЕНИЕ(Шаблоны.Ответственный) КАК ОтветственныйПредставление,
				|	Шаблоны.Ответственный КАК Ответственный,
				|	ПРЕДСТАВЛЕНИЕ(Шаблоны.ГрифДоступа) КАК ГрифДоступаПредставление,
				|	Шаблоны.ГрифДоступа КАК ГрифДоступа
				|ИЗ
				|	Справочник.ШаблоныВнутреннихДокументов КАК Шаблоны
				|ГДЕ
				|	Шаблоны.Ссылка = &Шаблон";
		Запрос.УстановитьПараметр("Шаблон", Шаблон);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтруктураПредставлений.Папка				= Выборка.ПапкаПредставление;
			СтруктураПредставлений.ВопросДеятельности	= Выборка.ВопросДеятельностиПредставление;
			СтруктураПредставлений.Ответственный		= Выборка.ОтветственныйПредставление;
			СтруктураПредставлений.ГрифДоступа			= Выборка.ГрифДоступаПредставление;
			
			ПапкаШаблона								= Выборка.Папка;
			ВопросДеятельностиШаблона					= Выборка.ВопросДеятельности;
			ОтветственныйШаблона						= Выборка.Ответственный;
			ГрифДоступаШаблона							= Выборка.ГрифДоступа;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Папка.АвтоОтметкаНезаполненного = Не ЗначениеЗаполнено(ПапкаШаблона);
	Если ЗначениеЗаполнено(СтруктураПредставлений.Папка) Тогда
		Элементы.Папка.Подсказка = СтрШаблон(
			НСтр("ru = 'В шаблоне документа: %1'"),
			СтруктураПредставлений.Папка);
		Элементы.Папка.ПодсказкаВвода = СтрШаблон(
			НСтр("ru = 'Из шаблона: %1'"),
			СтруктураПредставлений.Папка);
	Иначе
		Элементы.Папка.Подсказка = НСтр("ru = 'В шаблоне не заполнена'");
		Элементы.Папка.ПодсказкаВвода = "";
	КонецЕсли;
	Элементы.Папка.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Папка) И Не ЗначениеЗаполнено(ПапкаШаблона);
	
	Элементы.ВопросДеятельности.АвтоОтметкаНезаполненного = Не ЗначениеЗаполнено(ВопросДеятельностиШаблона);
	Если ЗначениеЗаполнено(СтруктураПредставлений.ВопросДеятельности) Тогда
		Элементы.ВопросДеятельности.Подсказка = СтрШаблон(
			НСтр("ru = 'В шаблоне документа: %1'"),
			СтруктураПредставлений.ВопросДеятельности);
		Элементы.ВопросДеятельности.ПодсказкаВвода = СтрШаблон(
			НСтр("ru = 'Из шаблона: %1'"),
			СтруктураПредставлений.ВопросДеятельности);
	Иначе
		Элементы.ВопросДеятельности.Подсказка = НСтр("ru = 'В шаблоне не заполнен'");
		Элементы.ВопросДеятельности.ПодсказкаВвода = "";
	КонецЕсли;
	Элементы.ВопросДеятельности.ОтметкаНезаполненного =
		Не ЗначениеЗаполнено(ВопросДеятельности) И Не ЗначениеЗаполнено(ВопросДеятельностиШаблона);
	
	Элементы.Ответственный.АвтоОтметкаНезаполненного =
		Не ЗначениеЗаполнено(ОтветственныйШаблона) И ОбязательноеУказаниеОтветственного;
	Если ЗначениеЗаполнено(СтруктураПредставлений.Ответственный) Тогда
		Элементы.Ответственный.Подсказка = СтрШаблон(
			НСтр("ru = 'В шаблоне документа: %1'"),
			СтруктураПредставлений.Ответственный);
		Элементы.Ответственный.ПодсказкаВвода = СтрШаблон(
			НСтр("ru = 'Из шаблона: %1'"),
			СтруктураПредставлений.Ответственный);
	Иначе
		Элементы.Ответственный.Подсказка = НСтр("ru = 'В шаблоне не заполнен'");
		Элементы.Ответственный.ПодсказкаВвода = "";
	КонецЕсли;
	Элементы.Ответственный.ОтметкаНезаполненного =
		Не ЗначениеЗаполнено(Ответственный) И Не ЗначениеЗаполнено(ОтветственныйШаблона)
		И ОбязательноеУказаниеОтветственного;
	
	Элементы.ГрифДоступа.АвтоОтметкаНезаполненного = Не ЗначениеЗаполнено(ГрифДоступаШаблона);
	Если ЗначениеЗаполнено(СтруктураПредставлений.ГрифДоступа) Тогда
		Элементы.ГрифДоступа.Подсказка = СтрШаблон(
			НСтр("ru = 'В шаблоне документа: %1'"),
			СтруктураПредставлений.ГрифДоступа);
		Элементы.ГрифДоступа.ПодсказкаВвода = СтрШаблон(
			НСтр("ru = 'Из шаблона: %1'"),
			СтруктураПредставлений.ГрифДоступа);
	Иначе
		Элементы.ГрифДоступа.Подсказка = НСтр("ru = 'В шаблоне не заполнен'");
		Элементы.ГрифДоступа.ПодсказкаВвода = "";
	КонецЕсли;
	Элементы.ГрифДоступа.ОтметкаНезаполненного =
		Не ЗначениеЗаполнено(ГрифДоступа) И Не ЗначениеЗаполнено(ГрифДоступаШаблона);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПодсказкиЭлементовПоШаблону()

	Если Не ЗначениеЗаполнено(Шаблон) Тогда
	
		Элементы.Папка.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Элементы.ВопросДеятельности.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Элементы.Ответственный.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Элементы.ГрифДоступа.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	
	Иначе
	
		Элементы.Папка.ОтображениеПодсказки = 
			?(ЗначениеЗаполнено(Папка) И ЗначениеЗаполнено(ПапкаШаблона),
				ОтображениеПодсказки.ОтображатьСнизу,
				ОтображениеПодсказки.Нет);
		Элементы.ВопросДеятельности.ОтображениеПодсказки = 
			?(ЗначениеЗаполнено(ВопросДеятельности) И ЗначениеЗаполнено(ВопросДеятельностиШаблона),
				ОтображениеПодсказки.ОтображатьСнизу,
				ОтображениеПодсказки.Нет);
		Элементы.Ответственный.ОтображениеПодсказки = 
			?(ЗначениеЗаполнено(Ответственный) И ЗначениеЗаполнено(ОтветственныйШаблона),
				ОтображениеПодсказки.ОтображатьСнизу,
				ОтображениеПодсказки.Нет);
		Элементы.ГрифДоступа.ОтображениеПодсказки = 
			?(ЗначениеЗаполнено(ГрифДоступа) И ЗначениеЗаполнено(ГрифДоступаШаблона),
				ОтображениеПодсказки.ОтображатьСнизу,
				ОтображениеПодсказки.Нет);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьКорректностьШаблона(ШаблонЗаполнения)
	
	СтруктураВозврата = Новый Структура("Успех, Описание");
	
	РезультатВыделенияПараметров = ОбменСКонтрагентамиДОСервер.ПараметрыВШаблонеСтроковогоПоля(ШаблонЗаполнения);
	
	Если Не РезультатВыделенияПараметров.Успех Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, РезультатВыделенияПараметров);
		
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ДеревоПараметров = ОбменСКонтрагентамиДОСервер.ДеревоПараметровЗаполненияСтроковыхПолей(
		"ДеревоПараметровСозданияДокумента");
	
	Для Каждого ИмяПараметра Из РезультатВыделенияПараметров.МассивПараметров Цикл
		Если ДеревоПараметров.Строки.Найти(ИмяПараметра, "ПредставлениеПолное", Истина) = Неопределено Тогда
			
			СтруктураВозврата.Успех = Ложь;
			СтруктураВозврата.Описание = СтрШаблон(
				НСтр("ru = 'Параметр [%1] не найден в возможных параметрах заполнения.'"),
				ИмяПараметра);
			
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата.Успех = Истина;
	СтруктураВозврата.Описание = НСтр("ru = 'Шаблон заполнения корректен'");
	
	Возврат СтруктураВозврата;
	
КонецФункции // ()

&НаСервере
Процедура УстановитьВидимостьДоступностьПоПереходуНаНовуюВерсию()
	
	ТолькоПросмотр = Истина;
	Элементы.ГруппаМиграцияНаНовуюВерсию.Видимость = Истина;
	Элементы.ФормаКомандаЗаписатьИЗакрыть.Доступность = Ложь;
	
	Элементы.НадписьМиграцияНаНовуюВерсию.Заголовок =
		НСтр("ru = 'Обмен с контрагентами по ЭДО выполняется и настраивается в новой версии программы. Настройки создания документов необходимо производить в новой версии программы.'");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРедактированияНаименования(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонНаименования = Результат;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРедактированияСодержания(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонСодержания = Результат;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#Область ЗакрытиеФормы

&НаКлиенте
Процедура ВыполнитьЗакрытиеФормы()
	
	Если Не ЗакрытьФормуССохранениемДанных Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = ПараметрыИнициализацииФормы();
	ЗаполнитьЗначенияСвойств(ПараметрыЗакрытия, ЭтотОбъект);
	
	// Дополнительные служебные свойства
	ПараметрыЗакрытия.Вставить("Модифицированность", Модифицированность);
	ПараметрыЗакрытия.Вставить("ИндексКартинкиОтраженияВДО", ИндексКартинкиОтраженияВДО());
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Функция НеобходимоЗадатьВопросОСохранении()
	
	Возврат Модифицированность И Не НеПоказыватьВопросОСохраненииПриЗакрытии;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВопросОСохраненииНастроек()
	
	ТекстВопроса = НСтр("ru = 'Настройки создания документов были изменены. Сохранить изменения?'");
	
	ОбработчикОтвета = Новый ОписаниеОповещения("ОбработатьОтветНаВопросОСохраненииНастроек", ЭтотОбъект);
	
	ПоказатьВопрос(ОбработчикОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , ,
		НСтр("ru = 'Сохранение настроек'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветНаВопросОСохраненииНастроек(Результат, Контекст) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да
		И Результат <> КодВозвратаДиалога.Нет Тогда
		
		Возврат;
	КонецЕсли;
	
	НеПоказыватьВопросОСохраненииПриЗакрытии = Истина;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьФормуССохранениемДанных = Истина;
	Иначе
		ЗакрытьФормуССохранениемДанных = Ложь;
	КонецЕсли;
	
	ВыполнитьЗакрытиеФормы();
	
КонецПроцедуры

&НаКлиенте
Функция НеобходимоЗадатьВопросОНекорректныхНастройках()
	
	Возврат 
		ЗакрытьФормуССохранениемДанных
		И Не ПоказанВопросОНекорректностиНастроек
		И Не НастройкиКорректны();
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВопросОСохраненииНекорректныхНастроек()
	
	СообщитьПользователюОбОшибкахЗаполнения();
	
	ТекстВопроса =
		НСтр("ru = 'В настройках создания документов присутствуют ошибки. Документы могут не создаваться.
		|Записать настройки в таком виде?'");
	
	ОбработчикОтвета = Новый ОписаниеОповещения("ОбработатьОтветНаВопросОСохраненииНекорректныхНастроек", ЭтотОбъект);
	
	ПоказатьВопрос(ОбработчикОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , ,
		НСтр("ru = 'Сохранение настроек'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветНаВопросОСохраненииНекорректныхНастроек(Результат, Контекст) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПоказанВопросОНекорректностиНастроек = Истина;
	
	ВыполнитьЗакрытиеФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаНастроек

&НаКлиенте
Функция ИндексКартинкиОтраженияВДО()
	
	ИндексКартинки = 3;
	
	Если Не ЗначениеЗаполнено(ШаблонНаименования) Тогда
		ИндексКартинки = Мин(2, ИндексКартинки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Папка)
		И Не ЗначениеЗаполнено(ПапкаШаблона) Тогда
		
		ИндексКартинки = Мин(1, ИндексКартинки);
	КонецЕсли;
	
	Если ИспользоватьГрифыДоступа
		И Не ЗначениеЗаполнено(ГрифДоступа)
		И Не ЗначениеЗаполнено(ГрифДоступаШаблона) Тогда
		
		ИндексКартинки = Мин(1, ИндексКартинки);
	КонецЕсли;
	
	Если ИспользоватьВопросыДеятельности
		И Не ЗначениеЗаполнено(ВопросДеятельности)
		И Не ЗначениеЗаполнено(ВопросДеятельностиШаблона) Тогда
		
		ИндексКартинки = Мин(1, ИндексКартинки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный)
		И Не ЗначениеЗаполнено(ОтветственныйШаблона)
		И ОбязательноеУказаниеОтветственного Тогда
		
		ИндексКартинки = Мин(1, ИндексКартинки);
	КонецЕсли;
	
	РезультатПроверкиШаблонаНаименования = ПроверитьКорректностьШаблона(ШаблонНаименования);
	
	Если Не РезультатПроверкиШаблонаНаименования.Успех Тогда
		ИндексКартинки = Мин(2, ИндексКартинки);
	КонецЕсли;
	
	РезультатПроверкиШаблонаСодержания = ПроверитьКорректностьШаблона(ШаблонСодержания);
	
	Если Не РезультатПроверкиШаблонаСодержания.Успех Тогда
		ИндексКартинки = Мин(2, ИндексКартинки);
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции

&НаКлиенте
Процедура СообщитьПользователюОбОшибкахЗаполнения()
	
	Если Не ЗначениеЗаполнено(ШаблонНаименования) Тогда
		
		ТекстСообщения = НСтр("ru = 'Шаблон наименования не заполнен. Документы будут создаватья по типовому шаблону'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения, ,
			"ШаблонНаименования");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Папка)
		И Не ЗначениеЗаполнено(ПапкаШаблона) Тогда
		
		Если ЗначениеЗаполнено(Шаблон) Тогда
			ТекстСообщения = НСтр("ru = 'Папка не указана ни в шаблоне, ни в настройках'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Папка не указана'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения, ,
			"Папка");
			
	КонецЕсли;
	
	Если ИспользоватьГрифыДоступа
		И Не ЗначениеЗаполнено(ГрифДоступа)
		И Не ЗначениеЗаполнено(ГрифДоступаШаблона) Тогда
		
		Если ЗначениеЗаполнено(ГрифДоступа) Тогда
			ТекстСообщения = НСтр("ru = 'Гриф доступа не указан ни в шаблоне, ни в настройках'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Гриф доступа не указан'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения, ,
			"ГрифДоступа");
		
	КонецЕсли;
	
	Если ИспользоватьВопросыДеятельности
		И Не ЗначениеЗаполнено(ВопросДеятельности)
		И Не ЗначениеЗаполнено(ВопросДеятельностиШаблона) Тогда
		
		Если ЗначениеЗаполнено(Шаблон) Тогда
			ТекстСообщения = НСтр("ru = 'Вопрос деятельности не указан ни в шаблоне, ни в настройках'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Вопрос деятельности не указан'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения, ,
			"ВопросДеятельности");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный)
		И Не ЗначениеЗаполнено(ОтветственныйШаблона)
		И ОбязательноеУказаниеОтветственного Тогда
		
		Если ЗначениеЗаполнено(Шаблон) Тогда
			ТекстСообщения = НСтр("ru = 'Ответственный не указан ни в шаблоне, ни в настройках'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Ответственный не указан'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения, ,
			"ВопросДеятельности");
		
	КонецЕсли;
	
	РезультатПроверкиШаблонаНаименования = ПроверитьКорректностьШаблона(ШаблонНаименования);
	
	Если Не РезультатПроверкиШаблонаНаименования.Успех Тогда
		
		ТекстСообщения = НСтр("ru = 'Шаблон наименования документа заполнен некорректно:'")
			+ Символы.ПС
			+ РезультатПроверкиШаблонаНаименования.Описание;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения, ,
			"ШаблонНаименования");
		
	КонецЕсли;
	
	РезультатПроверкиШаблонаСодержания = ПроверитьКорректностьШаблона(ШаблонСодержания);
	
	Если Не РезультатПроверкиШаблонаСодержания.Успех Тогда
		
		ТекстСообщения = НСтр("ru = 'Шаблон содержания документа заполнен некорректно:'")
			+ Символы.ПС
			+ РезультатПроверкиШаблонаСодержания.Описание;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения, ,
			"ШаблонСодержания");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НастройкиКорректны()
	
	Если Не ЗначениеЗаполнено(ШаблонНаименования) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Папка)
		И Не ЗначениеЗаполнено(ПапкаШаблона) Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	Если ИспользоватьГрифыДоступа
		И Не ЗначениеЗаполнено(ГрифДоступа)
		И Не ЗначениеЗаполнено(ГрифДоступаШаблона) Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	Если ИспользоватьВопросыДеятельности
		И Не ЗначениеЗаполнено(ВопросДеятельности)
		И Не ЗначениеЗаполнено(ВопросДеятельностиШаблона) Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный)
		И Не ЗначениеЗаполнено(ОтветственныйШаблона)
		И ОбязательноеУказаниеОтветственного Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	РезультатПроверкиШаблонаНаименования = ПроверитьКорректностьШаблона(ШаблонНаименования);
	
	Если Не РезультатПроверкиШаблонаНаименования.Успех Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РезультатПроверкиШаблонаСодержания = ПроверитьКорректностьШаблона(ШаблонСодержания);
	
	Если Не РезультатПроверкиШаблонаСодержания.Успех Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти
